Австралия/src/InformationRegisters/ReportMailingStates/ReportMailingStates.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ReportMailingStates</name>
  <resources>
    <name>LastRunStart</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>LastRunCompletion</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>SuccessfulStart</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>Executed</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>WithErrors</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>SessionNumber</name>
    <comment>Used to filter the event log by a number of report mailing session. For more information, see InfobaseSessionNumber in Syntax Assistant.</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>25</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>BulkEmail</name>
    <type>
      <types>CatalogRef.ReportMailings</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Австралия/src/InformationRegisters/ReportMailingStates/ManagerModule.bsl
///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2019, 1C-Soft LLC
// All Rights reserved. This application and supporting materials are provided under the terms of 
// Attribution 4.0 International license (CC BY 4.0)
// The license text is available at:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#If Server Or ThickClientOrdinaryApplication Or ExternalConnection Then

#Region Private

// For internal use.
// 
Procedure FixMailingStart(BulkEmail) Export
	SetPrivilegedMode(True);
	
	BeginTransaction();
	Try
		Lock = New DataLock();
		LockItem = Lock.Add("InformationRegister.ReportMailingStates");
		LockItem.SetValue("BulkEmail", BulkEmail);
		Lock.Lock();
		
		RecordManager = CreateRecordManager();
		RecordManager.BulkEmail = BulkEmail;
		RecordManager.Read();
		
		RecordManager.BulkEmail = BulkEmail;
		RecordManager.LastRunStart = CurrentSessionDate();
		// In case the FixMailingExecutionResult will not be called due to an unprocessed exception.
		RecordManager.LastRunCompletion = RecordManager.LastRunStart + 30 * 60; 
		RecordManager.SessionNumber = InfoBaseSessionNumber();
		RecordManager.Executed = False;
		RecordManager.WithErrors = True;
		
		RecordManager.Write(True);
		
		CommitTransaction();
	Except
		RollbackTransaction();
		Raise;
	EndTry;
EndProcedure

// For internal use.
// 
Procedure FixMailingExecutionResult(BulkEmail, ExecutionResult) Export
	SetPrivilegedMode(True);
	
	BeginTransaction();
	Try
		Lock = New DataLock();
		LockItem = Lock.Add("InformationRegister.ReportMailingStates");
		LockItem.SetValue("BulkEmail", BulkEmail);
		Lock.Lock();
		
		RecordManager = CreateRecordManager();
		RecordManager.BulkEmail = BulkEmail;
		RecordManager.Read();
		
		RecordManager.BulkEmail = BulkEmail;
		RecordManager.WithErrors = ExecutionResult.HadErrors OR ExecutionResult.HasWarnings;
		RecordManager.Executed = ExecutionResult.ExecutedToFolder
			Or ExecutionResult.ExecutedToNetworkDirectory
			Or ExecutionResult.ExecutedAtFTP
			Or ExecutionResult.ExecutedByEmail
			Or Not RecordManager.WithErrors;
		If RecordManager.Executed Then
			RecordManager.SuccessfulStart = RecordManager.LastRunStart;
		EndIf;
		RecordManager.LastRunCompletion = CurrentSessionDate();
		
		RecordManager.Write(True);
		CommitTransaction();
	Except
		RollbackTransaction();
		Raise;
	EndTry;
EndProcedure

#EndRegion

#EndIf
